Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG00/svd/PIC32CK2051SG00064.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PM</name>
         <version>039261b0</version>
         <description>Power Manager</description>
         <baseAddress>0x44006000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xA</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PM</name>
            <value>3</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>IORET</name>
                     <description>I/O Retention</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>IORETSelect</name>
                        <enumeratedValue>
                           <name>NOIORET</name>
                           <description>When  the  device  exits  the  HIBERNATE or BACKUP  mode,  the  I/O  line  configuration are released.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IORET</name>
                           <description>When  the  device  exits  the  HIBERNATE or BACKUP  mode,  the  I/O  line  configuration are stretched.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SLEEPCFG</name>
               <description>Sleep Configuration</description>
               <addressOffset>0x1</addressOffset>
               <size>8</size>
               <resetValue>0x02</resetValue>
               <fields>
                  <field>
                     <name>SLEEPMODE</name>
                     <description>Sleep Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>SLEEPMODESelect</name>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>CPU, AHB and APB clocks are OFF</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STANDBY</name>
                           <description>All Clocks are OFF</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIBERNATE</name>
                           <description>Backup domain is ON as well as some PDRAMs</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BACKUP</name>
                           <description>Only Backup domain is powered ON</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>All power domains are powered OFF</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENCLR</name>
               <description>Interrupt Enable Clear</description>
               <addressOffset>0x4</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SLEEPRDY</name>
                     <description>Backup Sleep Mode Entry Ready Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTENSET</name>
               <description>Interrupt Enable Set</description>
               <addressOffset>0x5</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SLEEPRDY</name>
                     <description>Backup Sleep Mode Entry Ready Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag Status and Clear</description>
               <addressOffset>0x6</addressOffset>
               <size>8</size>
               <resetValue>0x01</resetValue>
               <fields>
                  <field>
                     <name>SLEEPRDY</name>
                     <description>Backup Sleep Mode Entry Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STDBYCFG</name>
               <description>Standby Configuration</description>
               <addressOffset>0x8</addressOffset>
               <size>8</size>
               <resetValue>0x04</resetValue>
               <fields>
                  <field>
                     <name>RAMCFG</name>
                     <description>Ram Configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RAMCFGSelect</name>
                        <enumeratedValue>
                           <name>RET</name>
                           <description>All the RAMs are retained</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Only the first 32K bytes are retained</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPRAM</name>
                     <description>Low Power RAM Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HIBCFG</name>
               <description>Hibernate Configuration</description>
               <addressOffset>0x9</addressOffset>
               <size>8</size>
               <resetValue>0x04</resetValue>
               <fields>
                  <field>
                     <name>RAMCFG</name>
                     <description>Ram Configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RAMCFGSelect</name>
                        <enumeratedValue>
                           <name>RET</name>
                           <description>All the RAMs are retained</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Only the first 32K bytes are retained</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPRAM</name>
                     <description>Low Power RAM Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
