Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG00/svd/PIC32CK2051SG00064.svd
               <register>
                  <name>INTRRXE</name>
                  <description>Interrupt Enable Bits for INTRRX</description>
                  <addressOffset>0x1008</addressOffset>
                  <size>16</size>
                  <resetValue>0xFFFE</resetValue>
                  <fields>
                     <field>
                        <name>EP1RXE</name>
                        <description>Interrupt Enabled for RX EP1</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP2RXE</name>
                        <description>Interrupt Enabled for RX EP2</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP3RXE</name>
                        <description>Interrupt Enabled for RX EP3</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP4RXE</name>
                        <description>Interrupt Enabled for RX EP4</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP5RXE</name>
                        <description>Interrupt Enabled for RX EP5</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP6RXE</name>
                        <description>Interrupt Enabled for RX EP6</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EP7RXE</name>
                        <description>Interrupt Enabled for RX EP7</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTRUSB</name>
                  <description>Read Only Register Which Indicates Which USB Interrupts Are Currently Active.</description>
                  <addressOffset>0x100A</addressOffset>
                  <size>8</size>
                  <access>read-only</access>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SUSPEND</name>
                        <description>Set When Suspend Signal Is Detected On The Bus</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RESUME</name>
                        <description>Set When Resume Signal Is Detected On The Bus</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RESET</name>
                        <description>Set In Peripheral Mode when Reset Is Detected On The Bus. In HostMode When Babble Is Detected</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SOF</name>
                        <description>Set When A New Frame Starts</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CONN</name>
                        <description>Set When A Device Connection Is Detected</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DISCON</name>
                        <description>Set In Host Mode When A Device Disconnect Is Detected.Set In Peripheral Mode When A Session Ends</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SESSREQ</name>
                        <description>Set When Session Request Signaling Has Been Detected.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>VBUSERR</name>
                        <description>Set When VBus Drops Below The VBus Valid Threshold During A Session.</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTRUSBE</name>
                  <description>Interrupt Enable Bits for USB Interrupts</description>
                  <addressOffset>0x100B</addressOffset>
                  <size>8</size>
                  <resetValue>0x06</resetValue>
                  <fields>
                     <field>
                        <name>SUSPENDEN</name>
                        <description>SUSEPND Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RESUMEEN</name>
                        <description>RESUME Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RESETEN</name>
                        <description>RESET/BABBLE Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SOFEN</name>
                        <description>SOF Interrupt Enable</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CONNEN</name>
                        <description>CONN Interrupt Enable</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DISCONEN</name>
                        <description>DISCONN Interrupt Enable</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SESSREQEN</name>
                        <description>SESSREQ Interrupt Enable</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>VBUSERREN</name>
                        <description>VBus Error Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>FRAME</name>
                  <description>Holds The Last Received Frame Number</description>
                  <addressOffset>0x100C</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>FRMNUM</name>
                        <description>Frame Number</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>11</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INDEX</name>
                  <description>Index Is A 4-Bit Register That Determines Which Endpoint Control/Status Registers Are Accessed</description>
                  <addressOffset>0x100E</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>SELEP</name>
                        <description>The Selected Endpoint</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>SELEPSelect</name>
                           <enumeratedValue>
                              <name>EP0</name>
                              <description>Endpoint 0 Select</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EP1</name>
                              <description>Endpoint 1 Select</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EP2</name>
                              <description>Endpoint 2 Select</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EP3</name>
                              <description>Endpoint 3 Select</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EP4</name>
                              <description>Endpoint 4 Select</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EP5</name>
                              <description>Endpoint 5 Select</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EP6</name>
                              <description>Endpoint 6 Select</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EP7</name>
                              <description>Endpoint 7 Select</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EP8</name>
                              <description>Endpoint 8 Select</description>
                              <value>0x8</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TESTMODE</name>
                  <description>Not Used In Normal Operation. Configuration To Put the USBCORE Into One Of The Four Test Modes For HighSpeed Operation</description>
                  <addressOffset>0x100F</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>TESTSE0NAK</name>
                        <description>Set To Enter The Test_SE0_NAK mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TESTJ</name>
                        <description>Set To Enter The Test_J mode</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TESTK</name>
                        <description>Set To Enter The Test_K mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TESTPACKET</name>
                        <description>Set To Enter The Test_Packet mode</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FORCEHS</name>
                        <description>Depending On Bit 7 Force Controller Into High Speed Mode</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FORCEFS</name>
                        <description>Depending On Bit 7 Force Controller Into FS Speed Mode</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FIFOACCESS</name>
                        <description>The CPU Sets This Bit To Transfer The Packet In The Endpoint 0 TX FIFO To The Endpoint 0 Rx FIFO. It Is Cleared Automatically.</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FORCEHOST</name>
                        <description>The CPU Sets This Bit To Instruct The Core To Enter Host Mode When The Session Bit Is Set</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CSR0L_HOST_EP0_MODE</name>
                  <description>ENDPOINT0 Control And Status Bits for TX Endpoint 0</description>
                  <addressOffset>0x1012</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>RXPKTRDY</name>
                        <description>This Bit Is Set When A Data Packet Has Been Received</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXPKTRDY</name>
                        <description>The CPU Sets This Bit After Loading A Data Packet Into The FIFO.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXSTALL</name>
                        <description>This Bit Is Set When A Stall Handshake Is Received.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SETUPPKT</name>
                        <description>The CPU Sets This Bit, At The Same Time As The TxPktRdy Bit Is Set, To Send A SETUP Token Instead Of An OUT Token For The Transaction</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>This Bit Will Be Set When Three Attempts Have Been Made To Perform A Transaction With No Response From The Peripheral</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>REQPKT</name>
                        <description>The CPU Sets This Bit To Request An IN Transaction</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>STATUSPKT</name>
                        <description>The CPU Sets This Bit At The Same Time As The TxPktRdy Or ReqPkt Bit Is Set, To Perform A Status Stage Transaction</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NAKTIMEOUT</name>
                        <description>This Bit Will Be Set When Endpoint 0 Is Halted Following The Receipt Of NAK Responses For Longer Than The Time Set By The NAKLimit0 register.</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CSR0L_PERIPHERAL_EP0_MODE</name>
                  <description>ENDPOINT0 Control And Status Bits for TX Endpoint 0</description>
                  <alternateRegister>CSR0L_HOST_EP0_MODE</alternateRegister>
                  <addressOffset>0x1012</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>RXPKTRDY</name>
                        <description>This Bit Is Set When A Data Packet Has Been Received</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TXPKTRDY</name>
                        <description>The CPU Sets This Bit After Loading A Data Packet Into The FIFO.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SENTSTALL</name>
                        <description>This Bit Is Set When A Stall Handshake Is Transmitted.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DATAEND</name>
                        <description>The CPU Sets This Bit 1. When Setting TxPktRdy For The Last Data Packet 2. When Clearing RxPktRdy After Unloading The Last Data Packet.3. When Setting TxPktRdy For A Zero Length Data Packet.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SETUPEND</name>
                        <description>This Bit Will Be Set When A Control Transaction Ends Before The DataEnd Bit Has Been Set</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SENDSTALL</name>
                        <description>The CPU Writes A 1 To This Bit To Terminate The Current Transaction</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SERVICEDRXPKTRDY</name>
                        <description>The CPU Writes A 1 To This Bit To Clear The RxPktRdy Bit. It Is Cleared Automatically</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SERVICEDSETUPEND</name>
                        <description>The CPU Writes A 1 To This Bit To Clear The SetupEnd Bit. It Is Cleared Automatically.</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CSR0H_HOST_EP0_MODE</name>
                  <description>ENDPOINT0 Additional Control And Status Bits For TX Endpoint 0</description>
                  <addressOffset>0x1013</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>FLUSHFIFO</name>
                        <description>Flush The Next Packet To Be Transmitted/Read</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DATATOGGLE</name>
                        <description>When Read, This Bit Indicates The Current State Of The Endpoint 0 Data Toggle</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DATATOGGLEWRTENABLE</name>
                        <description>The CPU Writes A 1 To This Bit To Enable The Current State Of The Endpoint 0 Data Toggle To Be Written</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DISPING</name>
                        <description>The CPU Writes A 1 To This Bit To Instruct The Core Not To Issue PING Tokens In Data And Status Phases Of A High-Speed Control Transfer</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CSR0H_PERIPHERAL_EP0_MODE</name>
                  <description>ENDPOINT0 Additional Control And Status Bits For TX Endpoint 0</description>
                  <alternateRegister>CSR0H_HOST_EP0_MODE</alternateRegister>
                  <addressOffset>0x1013</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>FLUSHFIFO</name>
                        <description>Flush The Next Packet To Be Transmitted/Read</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
