Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG00/svd/PIC32CK2051SG00064.svd
               <register>
                  <name>CTHSBT</name>
                  <description>This Register Represents The Value To Be Added To The Minimum High Speed Timeout Period Of 736 Bit Times.</description>
                  <addressOffset>0x1348</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>HSTMEOUTADD</name>
                        <description>this register represents the value to be added to the mimumum high speed timeout period of 736 bit times</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LPMATTR</name>
                  <description>Defines The Attributes Of An LPM Transaction And Sleep Cycle.</description>
                  <addressOffset>0x1360</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>LINKSTATE</name>
                        <description>this value is provided by the host to the peripheral to indicate what state the peripheral must transition to after the receipt and acceptance of a lpm transaction.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>LINKSTATESelect</name>
                           <enumeratedValue>
                              <name>SLEEPSTATE</name>
                              <description>Sleep State (L1)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>HIRD</name>
                        <description>this is the host initiated resume duration.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>RMTWAK</name>
                        <description>this bit is the remote wakeup enable bit.</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENDPOINT</name>
                        <description>this is the endpnt that in the token packet of the lpm transaction.</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LPMCNTRL_HOST_MODE</name>
                  <description>LPM Control Register</description>
                  <addressOffset>0x1362</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>LPMXMT</name>
                        <description>software should set this bit to transmit an lpm transaction.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMRES</name>
                        <description>this bit is used by software to initiate a resume from the l1 state</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LPMCNTRL_PERIPHERAL_MODE</name>
                  <description>LPM Control Register</description>
                  <alternateRegister>LPMCNTRL_HOST_MODE</alternateRegister>
                  <addressOffset>0x1362</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>LPMXMT</name>
                        <description>this bit is set by software to instruct the core to transition to the l1 state upon the receipt of the next lpm transaction.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMRES</name>
                        <description>this bit is used by software to initiate resume (remote wakeup).</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMEN</name>
                        <description>this register is used to enable lpm in the musbmhdrc.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>LPMENSelect</name>
                           <enumeratedValue>
                              <name>LPMTRANS</name>
                              <description>Core supports LPM extended transactions</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EXTNTRANS</name>
                              <description>LPM is not supported but extended transactions are supported.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NOTSUPPORTED1</name>
                              <description>LPM and extended transactions are not supported</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NOTSUPPORTED2</name>
                              <description>LPM and extended transactions are not supported</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LPMNAK</name>
                        <description>this bit is used to place all end points in a state such that the response to all transactions other then an lpm transaction will be a nak.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LPMINTREN</name>
                  <description>LPM Interrupts Enable Register</description>
                  <addressOffset>0x1363</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>LPMSTEN</name>
                        <description>LPMMST interrupt</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMNYEN</name>
                        <description>LPMMNY interrupt</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMACKEN</name>
                        <description>LPMACK interrupt</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMNCEN</name>
                        <description>LPMNC interrupt</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMRESEN</name>
                        <description>LPMRES interrupt</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMERREN</name>
                        <description>LPMERR interrupt</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LPMINTR_HOST_MODE</name>
                  <description>Status Of The LPM Power State</description>
                  <addressOffset>0x1364</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>LPMST</name>
                        <description>this bit is set when an lpm transaction is transmitted and the device responds with a stall.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMNY</name>
                        <description>this bit is set when an lpm transaction is transmitted and the device responds with a nyet.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMACK</name>
                        <description>this bit is set when an lpm transaction is transmitted and the device responds with an ack.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMNC</name>
                        <description>this bit is set when an lpm transaction has been transmitted and has failed to complete.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMRES</name>
                        <description>this bit is set when the core has been resumed for any reason.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMERR</name>
                        <description>this bit is set if a response to the lpm transaction is received with a bit stuff error or a pid error</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LPMINTR_PERIPHERAL_MODE</name>
                  <description>Status Of The LPM Power State</description>
                  <alternateRegister>LPMINTR_HOST_MODE</alternateRegister>
                  <addressOffset>0x1364</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>LPMST</name>
                        <description>this bit is set when an lpm transaction is received and the core responds with a stall.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMNY</name>
                        <description>this bit is set when an lpm transaction is received and the core responds with a nyet</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMACK</name>
                        <description>this bit is set when an lpm transaction is received and the core responds with an ack.</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMNC</name>
                        <description>this bit is set when an lpm transaction is received and the core responds with a nyet due to data pending in the rx fifos.</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMRES</name>
                        <description>this bit is set if the core has been resumed for any reason.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LPMERR</name>
                        <description>this bit is set if an lpm transaction is received that has a linkstate field that is not supported</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>LPMFADDR</name>
                  <description>Function Address In LPM Payload</description>
                  <addressOffset>0x1365</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>FUNCADDR</name>
                        <description>function address that will be placed in the LPM payload</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY00</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1500</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000019</resetValue>
                  <fields>
                     <field>
                        <name>PREEMP</name>
                        <description>enables pre-emphasis</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>PREEMPSelect</name>
                           <enumeratedValue>
                              <name>SOFEOP</name>
                              <description>Enable pre-emphasis during SOF and EOP</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CHIRP</name>
                              <description>Enable pre-emphasis during chirp</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NONCHIRP</name>
                              <description>Enable pre-emphasis in non-chirp state</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ALWAYS</name>
                              <description>Always enable pre-emphasis</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SLEWRATE</name>
                        <description>adjust FS/LS slew rate</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SLEWRATESelect</name>
                           <enumeratedValue>
                              <name>HIGH</name>
                              <description>Highest slew rate</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MIDDLE0</name>
                              <description>Middle slew rate</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MIDDLE1</name>
                              <description>Middle slew rate</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SMALLEST</name>
                              <description>Smallest slew rate</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RXPHSSEL</name>
                        <description>RX clock phase select</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>RXPHSSELSelect</name>
                           <enumeratedValue>
                              <name>EARLIEST</name>
                              <description>Earliest phase</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>LATEST</name>
                              <description>Latest phase</description>
                              <value>0x7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY04</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1504</addressOffset>
                  <size>32</size>
                  <resetValue>0x0000008F</resetValue>
                  <fields>
                     <field>
                        <name>TXPHSSEL</name>
                        <description>set the Tx clock phase select</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>RSVD</name>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>HIZ</name>
                        <description>Set D+/D- to a high impedence state</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SQUELCH210</name>
                        <description>Lower 3 bits of RX squelch trigger point configuration</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY08</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1508</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000007</resetValue>
                  <fields>
                     <field>
                        <name>SQUELCH3</name>
                        <description>MSB of Squelch configuration</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RSVD</name>
                        <bitOffset>1</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY0C</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x150C</addressOffset>
                  <size>32</size>
                  <resetValue>0x000000E0</resetValue>
                  <fields>
                     <field>
                        <name>TUNE210</name>
                        <description>Lower 3 bits for HS amplitude tuning</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PHY10</name>
                  <description>USBHPHY Control Register.</description>
                  <addressOffset>0x1510</addressOffset>
                  <size>32</size>
                  <resetValue>0x000000AA</resetValue>
                  <fields>
                     <field>
                        <name>TUNE76543</name>
                        <description>Upper 5 bits for HS amplitude tuning</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>DRVTUNE210</name>
                        <description>Lower 3 bits for HS/FS/LS driver strength tuning</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
